# Terraform `environment` `prod`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.syncroot_github_repo["sdur"].azurerm_federated_identity_credential.syncroot_pusher_branches["main"] will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "azurerm_federated_identity_credential" "syncroot_pusher_branches" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/DIS_github_altinn_uami-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/Altinn-dis-demo-sdura-sdur-syncroot/federatedIdentityCredentials/Altinn-dis-demo-sdura-ref-main" -> null
      - issuer              = "https://token.actions.githubusercontent.com" -> null
      - name                = "Altinn-dis-demo-sdura-ref-main" -> null
      - parent_id           = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/DIS_github_altinn_uami-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/Altinn-dis-demo-sdura-sdur-syncroot" -> null
      - resource_group_name = "DIS_github_altinn_uami-rg" -> null
      - subject             = "repo:Altinn/dis-demo-sdura:ref:refs/heads/main" -> null
    }

  # module.syncroot_github_repo["sdur"].azurerm_federated_identity_credential.syncroot_pusher_envs["at22"] will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "azurerm_federated_identity_credential" "syncroot_pusher_envs" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/DIS_github_altinn_uami-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/Altinn-dis-demo-sdura-sdur-syncroot/federatedIdentityCredentials/Altinn-dis-demo-sdura-env-at22" -> null
      - issuer              = "https://token.actions.githubusercontent.com" -> null
      - name                = "Altinn-dis-demo-sdura-env-at22" -> null
      - parent_id           = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/DIS_github_altinn_uami-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/Altinn-dis-demo-sdura-sdur-syncroot" -> null
      - resource_group_name = "DIS_github_altinn_uami-rg" -> null
      - subject             = "repo:Altinn/dis-demo-sdura:environment:at22" -> null
    }

  # module.syncroot_github_repo["sdur"].azurerm_role_assignment.altinncr_pusher will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "azurerm_role_assignment" "altinncr_pusher" {
      - id                                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr/providers/Microsoft.Authorization/roleAssignments/a650a501-8c23-5336-b9ae-f336eb8ba821" -> null
      - name                                   = "a650a501-8c23-5336-b9ae-f336eb8ba821" -> null
      - principal_id                           = "b1e4a4ff-8f9c-468e-8e4d-9cf4333a8fa3" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/providers/Microsoft.Authorization/roleDefinitions/8311e382-0749-4cb8-b61a-304f252e45ec" -> null
      - role_definition_name                   = "AcrPush" -> null
      - scope                                  = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr" -> null
      - skip_service_principal_aad_check       = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.syncroot_github_repo["sdur"].azurerm_user_assigned_identity.syncroot_pusher will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "azurerm_user_assigned_identity" "syncroot_pusher" {
      - client_id           = "bbd52087-446b-444b-b095-6978b43543ce" -> null
      - id                  = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/DIS_github_altinn_uami-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/Altinn-dis-demo-sdura-sdur-syncroot" -> null
      - location            = "norwayeast" -> null
      - name                = "Altinn-dis-demo-sdura-sdur-syncroot" -> null
      - principal_id        = "b1e4a4ff-8f9c-468e-8e4d-9cf4333a8fa3" -> null
      - resource_group_name = "DIS_github_altinn_uami-rg" -> null
      - tags                = {
          - "env"                      = "prod"
          - "finops_environment"       = "prod"
          - "finops_product"           = "dis"
          - "finops_serviceownercode"  = null
          - "finops_serviceownerorgnr" = null
          - "org"                      = null
          - "product"                  = "sdur"
          - "repository"               = "https://github.com/Altinn/altinn-platform"
          - "submodule"                = "oidc-syncroot-pusher"
        } -> null
      - tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
        # (1 unchanged attribute hidden)
    }

  # module.syncroot_github_repo["sdur"].github_actions_secret.azure_client_id will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "github_actions_secret" "azure_client_id" {
      - created_at        = "2026-03-05 09:02:40 +0000 UTC" -> null
      - id                = "dis-demo-sdura:DIS_SYNCROOT_AZURE_CLIENT_ID" -> null
      - key_id            = "3380204578043523366" -> null
      - plaintext_value   = (sensitive value) -> null
      - remote_updated_at = "2026-03-05 09:02:40 +0000 UTC" -> null
      - repository        = "dis-demo-sdura" -> null
      - repository_id     = 1170746038 -> null
      - secret_name       = "DIS_SYNCROOT_AZURE_CLIENT_ID" -> null
      - updated_at        = "2026-03-05 09:02:40 +0000 UTC" -> null
    }

  # module.syncroot_github_repo["sdur"].github_actions_secret.azure_subscription_id will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "github_actions_secret" "azure_subscription_id" {
      - created_at        = "2026-03-05 09:02:21 +0000 UTC" -> null
      - id                = "dis-demo-sdura:DIS_SYNCROOT_AZURE_SUBSCRIPTION_ID" -> null
      - key_id            = "3380204578043523366" -> null
      - plaintext_value   = (sensitive value) -> null
      - remote_updated_at = "2026-03-05 09:02:21 +0000 UTC" -> null
      - repository        = "dis-demo-sdura" -> null
      - repository_id     = 1170746038 -> null
      - secret_name       = "DIS_SYNCROOT_AZURE_SUBSCRIPTION_ID" -> null
      - updated_at        = "2026-03-05 09:02:21 +0000 UTC" -> null
    }

  # module.syncroot_github_repo["sdur"].github_actions_secret.azure_tenant_id will be destroyed
  # (because module.syncroot_github_repo["sdur"] is not in configuration)
  - resource "github_actions_secret" "azure_tenant_id" {
      - created_at        = "2026-03-05 09:02:39 +0000 UTC" -> null
      - id                = "dis-demo-sdura:DIS_SYNCROOT_AZURE_TENANT_ID" -> null
      - key_id            = "3380204578043523366" -> null
      - plaintext_value   = (sensitive value) -> null
      - remote_updated_at = "2026-03-05 09:02:39 +0000 UTC" -> null
      - repository        = "dis-demo-sdura" -> null
      - repository_id     = 1170746038 -> null
      - secret_name       = "DIS_SYNCROOT_AZURE_TENANT_ID" -> null
      - updated_at        = "2026-03-05 09:02:39 +0000 UTC" -> null
    }

  # module.syncroot_github_repo["sdura"].azurerm_federated_identity_credential.syncroot_pusher_branches["main"] will be created
  + resource "azurerm_federated_identity_credential" "syncroot_pusher_branches" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "Altinn-dis-demo-sdura-ref-main"
      + parent_id           = (known after apply)
      + resource_group_name = "DIS_github_altinn_uami-rg"
      + subject             = "repo:Altinn/dis-demo-sdura:ref:refs/heads/main"
    }

  # module.syncroot_github_repo["sdura"].azurerm_federated_identity_credential.syncroot_pusher_envs["at22"] will be created
  + resource "azurerm_federated_identity_credential" "syncroot_pusher_envs" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "Altinn-dis-demo-sdura-env-at22"
      + parent_id           = (known after apply)
      + resource_group_name = "DIS_github_altinn_uami-rg"
      + subject             = "repo:Altinn/dis-demo-sdura:environment:at22"
    }

  # module.syncroot_github_repo["sdura"].azurerm_role_assignment.altinncr_pusher will be created
  + resource "azurerm_role_assignment" "altinncr_pusher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = "a5a1d18a-99a5-5dc1-93e1-6190b23ea383"
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr"
      + skip_service_principal_aad_check = true
    }

  # module.syncroot_github_repo["sdura"].azurerm_user_assigned_identity.syncroot_pusher will be created
  + resource "azurerm_user_assigned_identity" "syncroot_pusher" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "Altinn-dis-demo-sdura-sdura-syncroot"
      + principal_id        = (known after apply)
      + resource_group_name = "DIS_github_altinn_uami-rg"
      + tags                = {
          + "env"                      = "prod"
          + "finops_environment"       = "prod"
          + "finops_product"           = "dis"
          + "finops_serviceownercode"  = null
          + "finops_serviceownerorgnr" = null
          + "org"                      = null
          + "product"                  = "sdura"
          + "repository"               = "https://github.com/Altinn/altinn-platform"
          + "submodule"                = "oidc-syncroot-pusher"
        }
      + tenant_id           = (known after apply)
    }

  # module.syncroot_github_repo["sdura"].github_actions_secret.azure_client_id will be created
  + resource "github_actions_secret" "azure_client_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "dis-demo-sdura"
      + repository_id     = (known after apply)
      + secret_name       = "DIS_SYNCROOT_AZURE_CLIENT_ID"
      + updated_at        = (known after apply)
    }

  # module.syncroot_github_repo["sdura"].github_actions_secret.azure_subscription_id will be created
  + resource "github_actions_secret" "azure_subscription_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "dis-demo-sdura"
      + repository_id     = (known after apply)
      + secret_name       = "DIS_SYNCROOT_AZURE_SUBSCRIPTION_ID"
      + updated_at        = (known after apply)
    }

  # module.syncroot_github_repo["sdura"].github_actions_secret.azure_tenant_id will be created
  + resource "github_actions_secret" "azure_tenant_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "dis-demo-sdura"
      + repository_id     = (known after apply)
      + secret_name       = "DIS_SYNCROOT_AZURE_TENANT_ID"
      + updated_at        = (known after apply)
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Warning: Argument is deprecated

  with module.syncroot_github_repo["bfred"].azurerm_federated_identity_credential.syncroot_pusher_envs["at22"],
  on ../modules/syncroot-github-repo/azure-identity.tf line 14, in resource "azurerm_federated_identity_credential" "syncroot_pusher_envs":
  14:   resource_group_name = var.resource_group_name

This field is no longer used and will be removed in the next major version of
the Azure Provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @sduranc |
| Action | `push` |
| Working Directory | `./infrastructure/syncroots` |
| State File | `github.com/altinn/altinn-platform/environments/prod/syncroots.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_syncroots.tfstate.tfplan` |